Revit 2027 API
ElectricalSetting.AddVoltageType Method
 Add a new type definition of voltage into project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VoltageType AddVoltageType(
	string name,
	double actualValue,
	double minValue,
	double maxValue
)
Public Function AddVoltageType (
	name As String,
	actualValue As Double,
	minValue As Double,
	maxValue As Double
) As VoltageType
public:
VoltageType^ AddVoltageType(
	String^ name,
	double actualValue,
	double minValue,
	double maxValue
)
member AddVoltageType :
        name : string *
        actualValue : float *
        minValue : float *
        maxValue : float -> VoltageType
Parameters
name String
Specify voltage type name
actualValue Double
Specify actual value of voltage type.
minValue Double
Specify acceptable minimum value of the voltage type.
maxValue Double
Specify acceptable maximum value of the voltage type.
Return Value
VoltageType
New added voltage type object.
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace